app/controllers/images_controller.rb

  def create
    image = Image.new
    image.tag = params[:tag]
    image.save!
---
INSERT INTO "images" ("tag", "created_at", "updated_at") VALUES (?, ?, ?)  [["tag", "trumpet"], ["created_at", "2017-06-20 19:32:25.593800"], ["updated_at", "2017-06-20 19:32:25.593800"]]

  def download
    image = Image.find(params[:id])
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 1]]

  def upload
    image = Image.find(params[:id])
    image.data = request.raw_post
    image.save!
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "images" SET "data" = ?, "updated_at" = ? WHERE "images"."id" = ?  [["data", "<473831 bytes of binary data>"], ["updated_at", "2017-06-20 19:32:37.808924"], ["id", 1]]